//////////////////////////////////////////////////////////////
// НАЗВАНИЯ ОСОБЕННОСТЕЙ
//////////////////////////////////////////////////////////////
//Эльфы и Темные Эльфы
cpi_sprite_feat=Of the Light, Soars, No Retaliation, Fairy Dust, Magic Resistance, Susceptible to Fire, Known Enemy.
cpi_sprite2_feat=Of the Light, Soars, No Retaliation, Oblivion, Magic Resistance, Known Enemy.
cpi_dryad_feat=Of the Light, Soars, No Retaliation, Oblivion, Beautiful, Charm, Wood Fairy, Known Enemy.
cpi_werewolf_feat=Of the Light, Blades, Night Vision, Regeneration, Tolerance, Known Enemy.
cpi_wolf_feat=Of the Light, Beast, Night Vision, Rabid, Regeneration, Tolerance, Lycanthropy, Known Enemy.
cpi_satyr_feat=Of the Light, Sting of the Forest, No Melee Penalty, Spirit of the Wood, Known Enemy.
cpi_druid_feat=Of the Light, Force of Nature, Magic Resistance, Aura of Harmony, Known Enemy.
cpi_elf_feat=Of the Light, Shooter, Sniper, No Melee Penalty, Known Enemy.
cpi_elf2_feat=Of the Light, Shooter, Sniper, No Melee Penalty, Hunter, Known Enemy.
cpi_unicorn_feat=Of the Light, Horn of Light, Magic Resistance, Defender of Beauty, Known Enemy.
cpi_ent_feat=Of the Light, Plant, Wooden, Entangle, Known Enemy.
cpi_ent2_feat=Of the Light, Plant, Wooden, Entangle, Known Enemy.

cpi_dark_sprite_feat=Of the Dark, Soars, No Retaliation, Fairy Dust, Magic Resistance, Susceptible to Fire, Known Enemy.
cpi_dark_sprite2_feat=Of the Dark, Soars, No Retaliation, Oblivion, Magic Resistance, Known Enemy.
cpi_dark_dryad_feat=Of the Dark, Soars, No Retaliation, Oblivion, Beautiful, Charm, Wood Fairy, Known Enemy.
cpi_dark_werewolf_feat=Of the Dark, Blades, Night Vision, Regeneration, Tolerance, Known Enemy.
cpi_dark_wolf_feat=Of the Dark, Beast, Night Vision, Rabid, Regeneration, Tolerance, Lycanthropy, Known Enemy.
cpi_dark_satyr_feat=Of the Dark, Sting of the Forest, No Melee Penalty, Spirit of the Wood, Known Enemy.
cpi_dark_druid_feat=Of the Dark, Force of Nature, Magic Resistance, Aura of Harmony, Known Enemy.
cpi_dark_elf_feat=Of the Dark, Shooter, Sniper, No Melee Penalty, Known Enemy.
cpi_dark_elf2_feat=Of the Dark, Shooter, Sniper, No Melee Penalty, Hunter, Known Enemy.
cpi_dark_unicorn_feat=Of the Dark, Horn of Darkness, Magic Resistance, Defender of Beauty, Known Enemy.
cpi_dark_ent_feat=Of the Dark, Plant, Wooden, Entangle, Known Enemy.
cpi_dark_ent2_feat=Of the Dark, Plant, Wooden, Entangle, Known Enemy.


//Гномы, Цверги и примкнувшие к ним Дроидеки
cpi_miner_feat=Of the Light, Night Vision, Resentful.
cpi_dwarf_feat=Of the Light, Armored, Vengeful, Resentful.
cpi_miner2_feat=Of the Light, Night Vision, Chief, Resentful.
cpi_cannoner_feat=Of the Light, Shooter, Siege Weapon, No Melee Penalty, Resentful.
cpi_alchemist_feat=Of the Light, Acid Spray, No Melee Penalty, Poison Resistance, Applied Science, Resentful.
cpi_ingeneer_feat=Of the Light, Flamethrower, No Melee Penalty, Fire Resistance, Mechanic, Resentful.
cpi_giant_feat=Of the Light, Likes Emerald Dragons, Resentful.

cpi_dark_miner_feat=Of the Dark, Night Vision, Resentful.
cpi_dark_dwarf_feat=Of the Dark, Armored, Vengeful, Resentful.
cpi_dark_miner2_feat=Of the Dark, Night Vision, Chief, Resentful.
cpi_dark_cannoner_feat=Of the Dark, Shooter, Siege Weapon, No Melee Penalty, Resentful.
cpi_dark_alchemist_feat=Of the Dark, Acid Spray, No Melee Penalty, Poison Resistance, Applied Science, Resentful.
cpi_dark_ingeneer_feat=Of the Dark, Flamethrower, No Melee Penalty, Fire Resistance, Mechanic, Resentful.
cpi_dark_giant_feat=Of the Dark, Likes Emerald Dragons, Resentful.

cpi_droideka2_feat=Shock, Mechanical, Armored, Eyeless.
cpi_droideka_feat=Flight, Shooter, No Melee Penalty, Mechanical, Armored, Eyeless.


//Люди
cpi_peasant_feat=Of the Light, Team Spirit, Weed Killer, Fighting Spirit.
cpi_footman_feat=Of the Light, Armored, Prudence, Fighting Spirit.
cpi_footman2_feat=Of the Light, Armored, Prudence, Commander, Fighting Spirit.
cpi_bowman_feat=Of the Light, Shooter, Fighting Spirit.
cpi_priest_feat=Of the Light, Divine Strike, No Melee Penalty, Divine Defense, Magic Resistance, Fighting Spirit.
cpi_priest2_feat=Of the Light, Divine Strike, No Melee Penalty, Divine Defense, Magic Resistance, Fighting Spirit.
cpi_withchunter_feat=Of the Light, Mage Slayer, Magic Protection, Persistence of Mind, Restoration, Fighting Spirit.
cpi_horseman_feat=Of the Light, Armored, Horseman, Fighting Spirit.
cpi_knight_feat=Of the Light, Steel Armor, Mastery, Valor, Dragon Slayer, Fighting Spirit.
cpi_paladin_feat=Of the Light, Steel Armor, Divine Defense, Holy Warrior, Fighting Spirit.
cpi_archmage_feat=Of the Light, Lightning, Magic Protection, Persistence of Mind, Protector, Fighting Spirit.

cpi_dark_peasant_feat=Of the Dark, Team Spirit, Weed Killer, Fighting Spirit.
cpi_dark_footman_feat=Of the Dark, Armored, Prudence, Fighting Spirit.
cpi_dark_footman2_feat=Of the Dark, Armored, Prudence, Commander, Fighting Spirit.
cpi_dark_bowman_feat=Of the Dark, Shooter, Fighting Spirit.
cpi_dark_priest_feat=Of the Dark, Divine Strike, No Melee Penalty, Divine Defense, Magic Resistance, Fighting Spirit.
cpi_dark_priest2_feat=Of the Dark, Divine Strike, No Melee Penalty, Divine Defense, Magic Resistance, Fighting Spirit.
cpi_dark_withchunter_feat=Of the Dark, Mage Slayer, Magic Protection, Persistence of Mind, Restoration, Fighting Spirit.
cpi_dark_horseman_feat=Of the Dark, Armored, Horseman, Fighting Spirit.
cpi_dark_knight_feat=Of the Dark, Steel Armor, Mastery, Valor, Dragon Slayer, Fighting Spirit.
cpi_dark_paladin_feat=Of the Dark, Steel Armor, Divine Defense, Dark Warrior, Fighting Spirit.
cpi_dark_archmage_feat=Of the Dark, Lightning, Magic Protection, Persistence of Mind, Protector, Fighting Spirit.


//Викинги
cpi_slinger_man_feat=Hardened, Shooter, No Melee Penalty, Accurate, Runic Knowledge.
cpi_viking_feat=Hardened, Vengeful, Runic Knowledge.
cpi_skald_feat=Hardened, Armored, Pangs of Conscience, Singer, Escort to Valhalla, Runic Knowledge.
cpi_berserk2_feat=Hardened, Shock Shield, Mad Fury, Disregard for Pain, Runic Knowledge.
cpi_axthrower_feat=Hardened, Nimble, Axe Thrower, No Melee Penalty, Runic Knowledge.
cpi_valkyre_feat=Armored, Gift of Odin, Messenger of the Gods, Beautiful, Magic Resistance, Bear Cavalry, Runic Knowledge.
cpi_soothsayer_feat=Witching Staff, Divine Hand, Magic Resistance, Persistence of Mind, Keeper of Knowledge, Elemental Shield, Runic Knowledge.
cpi_yarl_feat=Hardened, Enchanted Armor, Daring, Elemental Axe, Shoulder to Shoulder, Runic Knowledge.


//Орки
cpi_goblin_feat=Of the Dark, Axe Thrower, No Melee Penalty, Zeroing In, Giant Killer, Greed, Adrenaline.
cpi_goblin2_feat=Of the Dark, Irascible, Giant Killer, Greed, Adrenaline.
cpi_goblin_rider_feat=Of the Dark, Ancestral Anger, No Melee Penalty, Spirit Talker, Keeper, Greed, Adrenaline.
cpi_catapult_feat=Of the Dark, Shooter, Siege Weapon, Pyromancer, Commander, Greed, Adrenaline.
cpi_orc_feat=Of the Dark, Armored, Thirst for Fight, Greed, Adrenaline.
cpi_orc2_feat=Of the Dark, Counterattack, Armored, Prudence, Greed, Adrenaline.
cpi_orс_scout_feat=Of the Dark, Shooter, Crossbowman, Wolf Cavalry, Greed, Adrenaline.
cpi_shaman_feat=Of the Dark, Adrenaline Control, Calm, Shaman, Persistence of Mind, Adrenaline.
cpi_ogre_feat=Of the Dark, Heavy Hand, Thick Skin, Greed, Adrenaline.
cpi_ogre_chieftain_feat=Of the Dark, Heavy Hand, Devastate, Armored, Poison Resistance, Commander, Greed, Adrenaline.


//Ящеры
cpi_gobot_feat=Of the Dark, Worm, Burrow, No Melee Penalty, Eyeless, Persistence of Mind.
cpi_gobot2_feat=Of the Dark, Worm, Burrow, Poisonous, No Melee Penalty, Eyeless, Persistence of Mind.
cpi_gorguana_feat=Of the Dark, Reptile, Spear, Rugged Scales, Horde, Bloodlust.
cpi_gorguana2_feat=Of the Dark, Reptile, Magic Missile, Rugged Scales, Magic Resistance, Horde, Bloodlust.
cpi_highterrant_feat=Of the Dark, Reptile, Flight, Sharp Beak, Magic Resistance.
cpi_chosha_feat=Of the Dark, Worm, Stationary, Persistence of Mind.
cpi_brontor_feat=Of the Dark, Reptile, Triple-horned, Rugged Scales, Spiked, Persistence of Mind.
cpi_digged_brontor_feat=Of the Dark, Reptile, Stationary, Cannot Counter, Rugged Scales, Spiked, Persistence of Mind.
cpi_tirex_feat=Of the Dark, Reptile, Tyrant, Rugged Scales, Giant Lizardman, Frightening, Predator.


//Демоны
cpi_firemental_feat=Of the Dark, Demon, Fire Elemental, Soars, Frenzy.
cpi_imp_feat=Of the Dark, Demon, Fire Thrower, Strike and Return, No Retaliation, Frenzy.
cpi_imp2_feat=Of the Dark, Demon, Fire Thrower, Strike and Return, No Retaliation, Frenzy.
cpi_cerberus_feat=Of the Dark, Demon, Three-headed, Frenzy.
cpi_priestess_blood_feat=Of the Dark, Demon, Armored, Blood Priestess, Beautiful, Frenzy.
cpi_demoness_feat=Of the Dark, Demon, Beautiful, Frenzy.
cpi_demon_feat=Of the Dark, Demon, Furious, Domination, Demonic Fury, Frenzy.
cpi_demon2_feat=Of the Dark, Demon, Furious, Domination, Demonic Fury, Terrifying, Frenzy.
cpi_archdemon_feat=Of the Dark, Demon, Persistence of Mind, Magic Resistance, Power over Fire, Teleportation, Restoration, Frenzy.


//Нежить
cpi_skeleton_feat=Of the Dark, Undead, Bone, Necro Energy.
cpi_archer_feat=Of the Dark, Undead, Shooter, Bone, Necro Energy.
cpi_spider_undead_feat=Of the Dark, Undead, Cursed, Necro Energy.
cpi_zombie_feat=Of the Dark, Undead, Necro Energy.
cpi_zombie2_feat=Of the Dark, Undead, Decaying, Necro Energy.
cpi_pirat_ghost_feat=Of the Dark, Undead, Marine, Cursed Treasure Hunter, Nimble, Necro Energy.
cpi_ghost_feat=Of the Dark, Undead, Soars, Phantom, Soul Draining, Necro Energy.
cpi_ghost2_feat=Of the Dark, Undead, Soars, Phantom, Soul Draining, Necro Energy.
cpi_vampire_feat=Of the Dark, Undead, Regeneration, No Retaliation, Necro Energy.
cpi_vampire2_feat=Of the Dark, Undead, Regeneration, No Retaliation, Death’s Deception, Necro Energy.
cpi_vampire_woman_feat=Of the Dark, Undead, Regeneration, No Retaliation, Death’s Deception, Necro Energy.
cpi_bat_feat=Of the Dark, Undead, Soars, No Retaliation, Vampirism, Necro Energy.
cpi_bat2_feat=Of the Dark, Undead, Soars, No Retaliation, Vampirism, Necro Energy.
cpi_vampiress_cloud_feat=Of the Dark, Undead, Soars, Phantom, Unarmed, Invulnerable, Necro Energy.
cpi_blackknight_feat=Of the Dark, Undead, Steel Armor, Mastery, Dark Commander, Rising Fury, Necro Energy.
cpi_necromant_feat=Of the Dark, Undead, Cloud of Darkness, Necromancer, Necro Energy.
cpi_bonedragon_feat=Of the Dark, Undead, Bone, Flight, Poison Breath, Necro Energy.


//Нейтралы
//гуманоиды
cpi_robber_feat=Robber, Greedy.
cpi_robber2_feat=Robber, Greedy.
cpi_barbarian_feat=Hardened, Vengeful.
cpi_berserk_feat=Berserker, Hardened, Vengeful.
cpi_pirat_feat=Excavator, Marine, Nimble.
cpi_pirat2_feat=Excavator, Marine, Nimble.
cpi_demonologist_feat=Flaming Skull, Demonology, Gatekeeper, Magic Resistance, Fire Resistance, Persistence of Mind.
cpi_assassin_feat=No Retaliation, Poisonous, Poison Resistance, Servant of Death, Known Enemy.
cpi_clown_feat=Metamorph, Daring, Nimble, Restoration.
cpi_powerman_feat=Night Vision, Persistence of Mind, Known Enemy.
cpi_gwf_feat=Unarmed, Bomber, Invulnerable, Night Vision, Persistence of Mind, Known Enemy.
cpi_horseamazon_feat=Shooter, Claustrophobic, Retreat.
cpi_dragon_rider_feat=Of the Dark, Flight, Breathes Fire, Fire Immunity, Magic Resistance, Dragon Guardian.
//тернии
cpi_thorn_feat=Shooter, Plant, Eyeless, No Melee Penalty.
cpi_thorn2_feat=Plant, Eyeless.
cpi_kingthorn_feat=Shooter, Plant, Eyeless, No Melee Penalty.
//пауки
cpi_spider_feat=Under-dweller, Stone Skin.
cpi_spider_fire_feat=Poison Protection, Fire Resistance, Vulnerable to Cold, Persistence of Mind, Flaming.
cpi_spider_venom_feat=Poisonous, Poison Immunity, Weakness to Fire.
cpi_spider_ice_feat=Under-dweller, Ice Creation, Spits Ice.
//звери
cpi_hyena_feat=Beast, Night Vision, Scavenger, Horde.
cpi_graywolf_feat=Beast, Night Vision, Rabid, Horde.
cpi_bear_feat=Beast, Brutal, Hibernation.
cpi_bear2_feat=Beast, Brutal, Hibernation.
cpi_bear_white_feat=Beast, Brutal, Hibernation, Hardened.
cpi_griffin_feat=Beast, Flight, Furious, Magic Resistance.
cpi_griffin2_feat=Beast, Flight, Furious, Magic Protection, Dragon Despiser, Regal.
cpi_griffinsp_feat=Flight, Furious, Phantom, Negates Magic.
//рептилии
cpi_snake_feat=Reptile, Poison Protection.
cpi_snake_green_feat=Reptile, Poisonous, Poison Immunity.
cpi_snake_royal_feat=Reptile, No Retaliation, Poisonous, Poison Immunity.
//рыбы
cpi_devilfish_feat=Marine, Susceptible to Fire, Night Vision, Frightening, Horde, Frightful Fish.
//дракончики
cpi_dragonfly_feat=Soars, Magic Resistance, Weakens, Paralyzes.
cpi_dragonfly_red_feat=Soars, Fire Resistance, Vulnerable to Cold.
//бехолдеры
cpi_beholder_feat=Soars, Shooter, Paralyzing Ray, No Melee Penalty, Under-dweller, Persistence of Mind.
cpi_beholder2_feat=Soars, Shooter, Paralyzing Ray, No Melee Penalty, Under-dweller, Persistence of Mind.
//драконы
cpi_dragon_ice_feat=Flight, Magic Immunity, Ice Creation, Freezing Touch, Creator, Claustrophobic.
cpi_greendragon_feat=Flight, Hates Giants, Magic Resistance, Fire Protection, Persistence of Mind.
cpi_blackdragon_feat=Flight, Breathes Fire, Fire Immunity, Magic Immunity, Persistence of Mind, Dragon Power.
cpi_reddragon_feat=Flight, Breathes Fire, Magic Resistance, Fire Immunity, Persistence of Mind.
//здоровяки
cpi_yotun_feat=Hardened, Enchanted Mace, Greed, Runic Knowledge.
cpi_cyclop_feat=Shooter, Sniper, Stone, No Melee Penalty.
cpi_troll_feat=Troll Skin, Petrify, Malevolent.
//Призванные
cpi_ice_minion_feat=Ice Creation, Nimble.
cpi_orb_feat=Ball, Ice Creation, No Retaliation.
cpi_book1_feat=Normal Spells, Magic Immunity, Persistence of Mind, Poison Protection, Vulnerable to Fire, Eyeless.
cpi_book2_feat=Strong Spells, Magic Immunity, Persistence of Mind, Poison Protection, Vulnerable to Fire, Eyeless.
cpi_book3_feat=Powerful Spells, Magic Immunity, Persistence of Mind, Poison Protection, Vulnerable to Fire, Eyeless.
cpi_lava_golem_feat=Lava, Flaming, Stuns, Magic Immunity.
cpi_phoenix_feat=Flight, Firestorm, Fire Immunity, Magic Immunity, Rebirth.
cpi_infernodragon_feat=Flight, Breathes Fire, Bone, Fire Immunity, Magic Immunity, Persistence of Mind, Flaming.




//////////////////////////////////////////////////////////////
// ОПИСАНИЕ ОСОБЕННОСТЕЙ
//////////////////////////////////////////////////////////////
// ОБЩЕЕ
//////////////////////////////////////////////////////////////
//Светлый-Темный
light_header=^def_hint_t0^Of the Light
light_hint=^def_hint_t1^Fights on the side of the Light.<br>The unit’s Morale falls if there are those of the Dark in the army.
dark_header=^def_hint_t0^Of the Dark
dark_hint=^def_hint_t1^Fights on the side of the Dark.<br>The unit’s Morale falls if there are those of the Light in the army.

tolerance_header=^def_hint_t0^Tolerance
tolerance_dark_1_hint=^def_hint_t1^Can tolerate the presence of creatures of the Dark in the army. Morale penalty is reduced by 1.
tolerance_dark_2_hint=^def_hint_t1^Can tolerate the presence of creatures of the Dark in the army. Morale penalty is reduced by 2.
tolerance_dark_3_hint=^def_hint_t1^Can tolerate the presence of creatures of the Dark in the army. Morale penalty is reduced by 3.
tolerance_dark_4_hint=^def_hint_t1^Can tolerate the presence of creatures of the Dark in the army. Morale penalty is reduced by 4.
tolerance_dark_5_hint=^def_hint_t1^Can tolerate the presence of creatures of the Dark in the army. Morale penalty is reduced by 5.
tolerance_light_1_hint=^def_hint_t1^Can tolerate the presence of creatures of the Light in the army. Morale penalty is reduced by 1.
tolerance_light_2_hint=^def_hint_t1^Can tolerate the presence of creatures of the Light in the army. Morale penalty is reduced by 2.
tolerance_light_3_hint=^def_hint_t1^Can tolerate the presence of creatures of the Light in the army. Morale penalty is reduced by 3.
tolerance_light_4_hint=^def_hint_t1^Can tolerate the presence of creatures of the Light in the army. Morale penalty is reduced by 4.
tolerance_light_5_hint=^def_hint_t1^Can tolerate the presence of creatures of the Light in the army. Morale penalty is reduced by 5.



//Особенность перемещения
soars_header=^def_hint_t0^Soars
soars_hint=^def_hint_t1^This unit can fly over low obstacles and irregular terrain.

flies_header=^def_hint_t0^Flight
flies_hint=^def_hint_t1^Troop can fly over low obstacles or rough terrain.

phantom_header=^def_hint_t0^Phantom
phantom_hint=^def_hint_t1^Receives half damage from Physical attacks and passes through the obstacles.



//Особенности от местности и времени
night_sight_header=^def_hint_t0^Night Vision
night_sight_hint=^def_hint_t1^During nighttime and underground combat, Attack is increased by 50%.

sea_header=^def_hint_t0^Marine
sea_hint=^def_hint_t1^During naval battles, morale is increased.

underground_header=^def_hint_t0^Under-dweller
underground_hint=^def_hint_t1^When combat takes place under ground, this unit's Attack is increased by 50%.

northerner_header=^def_hint_t0^Hardened
northerner_hint=^def_hint_t1^10% resistance to Cold.<br>On snowy terrain, Defense is increased by 50%.



//Особенность Атаки
no_weapon_header=^def_hint_t0^Unarmed
no_weapon_hint=^def_hint_t1^No base attack can cause direct harm to anyone.

no_melee_header=^def_hint_t0^No Melee Penalty
no_melee_hint=^def_hint_t1^The creature inflicts the same damage in both Melee and Ranged Attacks.

no_retaliation_header=^def_hint_t0^No Retaliation
no_retaliation_hint=^def_hint_t1^The enemy has no chance to counter-attack.

shot_header=^def_hint_t0^Shooter
shot_hint=^def_hint_t1^The primary attack is performed at range, whether it be firing, shooting, or throwing.

axe_thrower_header=^def_hint_t0^Axe Thrower
axe_thrower3_hint=^def_hint_t1^Can throw axes at the enemy at a distance of up to 3 cells. Receives some bonuses similar as shooters.
axe_thrower4_hint=^def_hint_t1^Can throw axes at the enemy at a distance of up to 4 cells. Some Shooter bonuses are received.

sniper_header=^def_hint_t0^Sniper
sniper_hint=^def_hint_t1^No penalty for the distance by Ranged Attack.

tireless_header=^def_hint_t0^Furious
tireless_hint=^def_hint_t1^Always retaliates against enemy attacks.

siege_weapon_header=^def_hint_t0^Siege Weapon
siege_weapon_cannoner_hint=^def_hint_t1^Inflicts 200% Damage with its base attack to obstacles, barriers, and Gremlin Towers.

dragon_breath_header=^def_hint_t0^Breathes Fire
dragon_breath_hint=^def_hint_t1^The troop strikes a target, and any troop behind it, with flaming breath. There is a 50% chance that the target will be set ablaze.

revengeful_header=^def_hint_t0^Vengeful
revengeful_hint=^def_hint_t1^If over 50% of the troop die, the chance of Critical Hit is increased by 100%.

poisonous_header=^def_hint_t0^Poisonous
poisonous_hint=^def_hint_t1^The creature has 30% chance of Poisoning the target for three turns.

ardor_header=^def_hint_t0^Daring
ardor_hint=^def_hint_t1^Upon inflicting a critical hit, the unit's Attack increases by 2, up to a max. +20.

furiousness_header=^def_hint_t0^Rabid
furiousness_hint=^def_hint_t1^This troop has a 20% chance of infecting the enemy with Rabid during an attack.



//особенности Защиты и получения Урона
beauty_header=^def_hint_t0^Beautiful
beauty_hint=^def_hint_t1^Befuddled by the image of a beautiful girl, male humanoids miss with a probability of 30%.

agility_header=^def_hint_t0^Nimble
agility_20_hint=^def_hint_t1^Troop has a 20% chance of evading an enemy attack.
agility_30_hint=^def_hint_t1^Troop has a 30% chance of evading an enemy attack.

alertness_header=^def_hint_t0^Cautious
alertness_hint=^def_hint_t1^The troop has a 10% chance of evading an enemy attack.<br>Every 4% of losses increase this chance of evasion by 1%.
alertness_orc2_hint=^def_hint_t1^10% chance to dodge an attack.<br>Each additional 10% of losses increase Dodge change by 1%.<br>Each 5 points of Adrenaline increase Dodge change by 2% to a maxium of 20% of Adrenaline.

learning_header=^def_hint_t0^Mastery
learning_hint=^def_hint_t1^Every time the troop receives damage, its base Defense can be increased by 30%, up to a total of 90%.<br>This bonus does not accrue when the troop is damaged by counterattacks or the effects of spells.

flaming_header=^def_hint_t0^Flaming
flaming_hint=^def_hint_t1^Enemies attacking this troop are set ablaze, if they have no Immunity to Fire damage.

retreat_header=^def_hint_t0^Retreat
retreat_hint=^def_hint_t1^Troop has a 30% chance of evading an enemy attack, bouncing back. After melee damage is received, the troop tries to increase its distance from the enemy, retreating 1 cell back. If the retreat is successful, a ranged attack is activated.
no_retreat_hint=^def_hint_t1^Creatures don’t have this feature yet.
retreat_orc_scout_hint=<gen=retreat_orc_scout_hint>




//Особенность резистов
armor_header=^def_hint_t0^Armored
armor_p10_hint=^def_hint_t1^10% resistance to Physical damage.
armor_p20_hint=^def_hint_t1^20% resistance to Physical damage.
armor_p10_f10_hint=^def_hint_t1^10% resistance to Physical damage. 10% resistance to Fire damage.
armor_p20_f10_hint=^def_hint_t1^20% resistance to Physical damage. 10% resistance to Fire damage.
armor_p20_f20_hint=^def_hint_t1^20% resistance to Physical damage. 20% resistance to Fire damage.
armor_p30_f10_hint=^def_hint_t1^30% resistance to Physical damage. 10% resistance to Fire damage.
armor_p30_f30_hint=^def_hint_t1^30% resistance to Physical damage. 30% resistance to Fire damage.

magic_resistance_header=^def_hint_t0^Magic Protection
magic_resistance_10_hint=^def_hint_t1^10% resistance to Magic damage.
magic_resistance_15_hint=^def_hint_t1^15% resistance to Magic damage.
magic_resistance_20_hint=^def_hint_t1^20% resistance to Magic damage.
magic_resistance_25_hint=^def_hint_t1^25% resistance to Magic damage.
magic_resistance_30_hint=^def_hint_t1^30% resistance to Magic damage.
magic_resistance_35_hint=^def_hint_t1^35% resistance to Magic damage.
magic_resistance_50_hint=^def_hint_t1^50% resistance to Magic damage.

magic_immunity_header=^def_hint_t0^Magic Immunity
magic_immunity_hint=^def_hint_t1^80% resistance to Magic damage. No spells affect the troop.

poison_resistance_header=^def_hint_t0^Poison Protection
poison_resistance_10_hint=^def_hint_t1^10% resistance to Poison damage.
poison_resistance_25_hint=^def_hint_t1^25% resistance to Poison damage.
poison_resistance_50_hint=^def_hint_t1^50% resistance to Poison damage.

poison_immunity_header=^def_hint_t0^Poison Immunity
poison_immunity_hint=^def_hint_t1^+80% resistance to Poison damage. The troop cannot be poisoned.

fire_resistance_header=^def_hint_t0^Fire Protection
fire_resistance_15_hint=^def_hint_t1^15% resistance to Fire damage.
fire_resistance_20_hint=^def_hint_t1^20% resistance to Fire damage.
fire_resistance_25_hint=^def_hint_t1^25% resistance to Fire damage.
fire_resistance_30_hint=^def_hint_t1^30% resistance to Fire damage.
fire_resistance_50_hint=^def_hint_t1^50% resistance to Fire damage.

fire_immunity_header=^def_hint_t0^Fire Immunity
fire_immunity_hint=^def_hint_t1^80% resistance to Fire damage. The troop cannot be burned.

fire_weakness_header=^def_hint_t0^Vulnerable to Fire
fire_weakness_10_hint=^def_hint_t1^-10% resistance to Fire damage.
fire_weakness_20_hint=^def_hint_t1^-20% resistance to Fire damage.
fire_weakness_50_hint=^def_hint_t1^-50% resistance to Fire damage.
fire_weakness_100_hint=^def_hint_t1^-100% resistance to Fire damage.

glacial_weakness_header=^def_hint_t0^Vulnerable to Frost
glacial_weakness_20_hint=^def_hint_t1^-20% resistance to Cold damage.
glacial_weakness_30_hint=^def_hint_t1^-30% resistance to Cold damage.

glacial_immunity_header=^def_hint_t0^Immunity to Cold
glacial_immunity_hint=^def_hint_t1^+80% resistance to Ice damage. The troop cannot be frozen.

beast_header=^def_hint_t0^Beast
beast_hint=^def_hint_t1^Vulnerable to Fire (Resistance -10%).<br>Protected from Cold (Resistance +10%).

mind_immunity_header=^def_hint_t0^Persistence of Mind
mind_immunity_hint=^def_hint_t1^The creature is immune to Mind Spells and effects.



//Особенности в начале хода
regeneration_header=^def_hint_t0^Regeneration
regeneration_hint=^def_hint_t1^Recovers the maximum points of Health with each turn.

clear_header=^def_hint_t0^Restoration
clear_hint=^def_hint_t1^Allows the creature to remove all negative effects from itself at the beginning of its turn.
clear_all_hint=^def_hint_t1^Allows the troop to remove all effects from itself at the beginning of its turn.



//Остальные фенечки
eyeless_header=^def_hint_t0^Eyeless
eyeless_hint=^def_hint_t1^This troop is immune to the spells "Blind" and "Precision," and suffers no visibility loss from being surrounded by Greasy Mist. Can detect invisible troops.

commander_header=^def_hint_t0^Commander
commander_footman2_hint=^def_hint_t1^<label=cpsn_bowman> and <label=cpsn_footman> receive +1 Morale.
commander_dark_footman2_hint=^def_hint_t1^<label=cpsn_dark_bowman> and <label=cpsn_dark_footman> receive +1 Morale.
commander_catapult_hint=^def_hint_t1^<label=cpsn_goblin>, <label=cpsn_goblin2>, and <label=cpn_goblin_rider> receive +1 Morale.<br> Every time <label=cpsn_dark_bowman> and <label=cpsn_dark_footman> receive Adrenaline, <label=cpsn_catapult> receive 1 Adrenaline.
commander_chieftain_hint=^def_hint_t1^<label=cpsn_orc>, <label=cpsn_orc2>, and <label=cpsn_ork_scout> receive +1 Morale.<br> Every time <label=cpsn_orc>, <label=cpsn_orc2>, and <label=cpsn_ork_scout> receive Adrenaline, <label=cpsn_ogre_chieftain> receive 1 Adrenaline.
commander_blackknight_hint=^def_hint_t1^All undead in the army receive +1 Morale.

avid_header=^def_hint_t0^Greedy
avid_hint=^def_hint_t1^After killing an enemy unit, the troop receives a Morale boost of 10 until the end of the fight, anticipating the spoils of victory.

debonair_header=^def_hint_t0^Metamorph
debonair_hint=^def_hint_t1^Rejoices when fighting various enemies into which it can transform. +1 Morale.


//Эльфы
elf_known_enemy_header=^def_hint_t0^Known Enemy
elf_known_enemy_hint=^def_hint_t1^You get to know your enemy in battle.<br>Every successful attack performed by [sel]this troop against an enemy troop[/c] increases the chance of Critical Hit against this type of troop by [sel]<gen=hintgen_elf_known_enemy_attack>[/c].<br>If a Critical Hit is scored, the information on the troop is reset.

faery_dust_header=^def_hint_t0^Fairy Dust
faery_dust_hint=^def_hint_t1^Can cast "Weakness" on the target during an attack.

discharge_header=^def_hint_t0^Oblivion
discharge_hint=^def_hint_t1^This troop's attack has a 50% chance of disabling all the target's skills.

charm_header=^def_hint_t0^Charm
charm_hint=^def_hint_t1^During her attack, the Dryad has a 20% chance of fascinating a male humanoid, turning him to fight on the Dryad's side.

wood_fairy_header=^def_hint_t0^Wood Fairy
wood_fairy_hint=^def_hint_t1^All plants in the army receive +1 Morale.

blade_header=^def_hint_t0^Blades
blade_hint=^def_hint_t1^The troop's serrated blades inflict severe wounds, decreasing the target's fighting ability.

licantropy_header=^def_hint_t0^Lycanthropy
licantropy_hint=^def_hint_t1^After biting the target, has a 30% change to turn 25% of the dead into werewolves, increasing own numbers. The number of the turned doubles at night or underground.<br>Only some humanoids can be infected with Lycanthropy.


satyr_shot_header=^def_hint_t0^Sting of the Forest
satyr_shot_hint=^def_hint_t1^Performs a Ranged Attack, producing a magical projectile that strikes the target and lowers its Attack and Defense by 1, up to a maximum penalty to Attack and Defense -5.

forest_spirit_header=^def_hint_t0^Spirit of the Wood
forest_spirit_hint=^def_hint_t1^During forest battles, Morale is increased.


druid_shot_header=^def_hint_t0^Force of Nature
druid_shot_hint=^def_hint_t1^Performs a Ranged Attack, Attack, producing a magical projectile that strikes the target and any surrounding enemy troops.

harmony_header=^def_hint_t0^Aura of Harmony
harmony_hint=^def_hint_t1^All Elves in the army gain +1 Morale.

hunter_header=^def_hint_t0^Naturalist
hunter_arrow_hint=^def_hint_t1^Inflicts 150% Damage against animals.<br>All ranged attacks <label=effect_bleed_name> have a 50% chance of causing this effect.

light_horn_header=^def_hint_t0^Horn of Light
light_horn_hint=^def_hint_t1^Inflicts an additional 30% Magic damage on all those of the Dark.

dark_horn_header=^def_hint_t0^Horn of Darkness
dark_horn_hint=^def_hint_t1^Inflicts an additional 30% Magic damage on all those of the Light.

defender_beauty_header=^def_hint_t0^Defender of Beauty
defender_beauty_hint=^def_hint_t1^Friendly <label=cpsn_sprite>, <label=cpsn_sprite_lake>, and <label=cpsn_dryad> receive +2 Morale.
defender_dark_beauty_hint=^def_hint_t1^Friendly <label=cpsn_dark_sprite>, <label=cpsn_dark_sprite_lake>, and <label=cpsn_dark_dryad> receive +2 Morale.

wood_header=^def_hint_t0^Wooden
wood_hint=^def_hint_t1^Resistance to Physical damage 10%.

tieroot_header=^def_hint_t0^Entangle
tieroot_30_hint=^def_hint_t1^Close-ranged combat has a 30% chance of entangling the enemy, temporarily reducing its Action Points to 1.
tieroot_50_hint=^def_hint_t1^In a melee it can with a 50% probability entangle the enemy, lowering its Action Points to 1.


//Гномы
dwarf_memory_header=^def_hint_t0^Resentful
dwarf_memory_hint=^def_hint_t1^The troop remembers all those who have ever attacked them successfully. When attacking the offender, they deal 20% more damage. After vengeance is achieved, they calm down and strike the offender off their blacklist.

foreman_header=^def_hint_t0^Chief
foreman_hint=^def_hint_t1^<label=cpsn_miner> in the army receive +100% base Attack and Defense.<br>When <label=cpsn_miner> go on strike, the unit is outraged, receiving +1 Speed and Initiative and a +100% chance of Critical Hit.
dark_foreman_hint=^def_hint_t1^<label=cpsn_dark_miner> in the army receive +100% base Attack and Defense.<br>When <label=cpsn_dark_miner> go on strike, the unit is outraged, receiving +1 Speed and Initiative and a +100% chance of Critical Hit.

acid_sprays_header=^def_hint_t0^Acid Spray
acid_sprays_hint=^def_hint_t1^The troop sprays, at a distance of up to 3 hexes, an acid spray which burns everything in its path. Targets have a 15% chance of being poisoned. The enemy cannot counter this attack. Some Shooter bonuses are received.

chemister_header=^def_hint_t0^Applied Science
chemister_hint=^def_hint_t1^Troop can create new potions and chemical mixtures, when they run out.

flamer_header=^def_hint_t0^Flamethrower
flamer_hint=^def_hint_t1^The troop sprays, at a distance of up to 3 hexes, a stream of fire which burns everything in its path. There is a 15% chance that the target will be set ablaze. The enemy cannot counter this attack. Some Shooter bonuses are received. There is a 15% chance that the target will be set ablaze.

robo_tech_header=^def_hint_t0^Mechanic
robo_tech_hint=^def_hint_t1^This troop creates new grenades when they are used up.<br>Tunes up any allied mechanisms. Droids enjoy: Attack +5, Speed +1.

hates_green_header=^def_hint_t0^Likes Emerald Dragons
hates_green_hint=^def_hint_t1^Considers Emerald Dragons an extremely tasty and healthy treat. The Morale of the Giants grows.


//Человеки
human_spirit=Fighting Spirit
human_spirit_header=^def_hint_t0^Fighting Spirit
human_spirit_40_hint=^def_hint_t1^+1 Morale if the troop’s strength is no less than 40% of its original numbers.
human_spirit_50_hint=^def_hint_t1^+1 Morale if the troop’s strength is no less than 50% of its original numbers.
human_spirit_60_hint=^def_hint_t1^+1 Morale if the troop’s strength is no less than 60% of its original numbers.

comradeship_header=^def_hint_t0^Team Spirit
comradeship_hint=^def_hint_t1^Increases Attack or Defense depending on curernt unit strength compared to starting unit strength. Maximum bonus is 20% of Attack or Defense.

plant_killer_header=^def_hint_t0^Weed Killer
plant_killer_hint=^def_hint_t1^Inflicts 200% Damage on plants.

mage_killer_header=^def_hint_t0^Mage Slayer
mage_killer_hint=^def_hint_t1^150% Damage is dealt to mages with base attacks.

holy_attack_header=^def_hint_t0^Divine Strike
holy_attack_dark_hint=^def_hint_t1^Attacks from afar, releasing a magical missile which deals extra damage to all creatures of the Dark.
holy_attack_light_hint=^def_hint_t1^Attacks from afar, releasing a magical missile which deals extra damage to all creatures of the Light.

priest_header=^def_hint_t0^Divine Defense
priest_hint=^def_hint_t1^The unit is resistant to Necromancy and Lycanthropy.

valorous_header=^def_hint_t0^Valor
valorous_hint=^def_hint_t1^A high self-esteem gives the creature a Morale +1.

dragon_slayer_header=^def_hint_t0^Dragon Slayer
dragon_slayer_hint=^def_hint_t1^The troop inflicts additional damage to dragons.

mage_header=^def_hint_t0^Lightning
mage_hint=^def_hint_t1^Can strike an enemy with lightning from any distance. Inflicts Magic Damage and has a chance of shocking the target.

archmage_header=^def_hint_t0^Protector
archmage_hint=^def_hint_t1^Protects nearby allies, increasing their Magic Resistance by 10%.<br>This has no effect on other Archmages.<br>Has no effect if the <label=special_battle_mage_name> effect is active.

cavalry_header=^def_hint_t0^Horseman
cavalry_hint=^def_hint_t1^When the troop is charging in a straight line, the damage of its attacks and talents is increased by 10% for each cell it passes through.

holy_warrior_header=^def_hint_t0^Holy Warrior
holy_warrior_hint=^def_hint_t1^A warrior of the Light, blessed to fight against the Dark. Inflicts additional damage on those of the Dark. This unit is protected from Magic damage (+30% Resistance to Magic damage).<br>After destroying those of the Dark with a total leadership equal to 50% of that of this unit, an additional charge for the <label=special_prayer_name> talent is received.

unholy_warrior_header=^def_hint_t0^Dark Warrior
unholy_warrior_hint=^def_hint_t1^A warrior of the Dark, blessed to fight against the Light. Inflicts additional damage on those of the Light. This unit is protected from Magic damage (+30% Resistance to Magic damage).<br>After destroying those of the Light with a total leadership equal to 50% of that of this unit, an additional charge for the <label=special_prayer_name> talent is received.


// Викинги
rune_knowledge_header=^def_hint_t0^Runic Knowledge
rune_knowledge_hint=^def_hint_t1^The troop has its own supply of Magic Runes.<br>The Attack Rune increases the damage dealt by the troop by 25% and the Defense Rune decreases the damage received by the troop by 15%. Each Rune is applied automatically once per turn, when inflicting or receiving damage.

throw_accurate_header=^def_hint_t0^Accurate
throw_accurate_hint=^def_hint_t1^Well-aimed throws force the target to fumble their weapons. With a probability of 20%, their base ranged attack inflicts Weakness with a Critical Hit.

reproach_header=^def_hint_t0^Pangs of Conscience
reproach_hint=^def_hint_t1^When attacking, with probability of 20% it can remind the enemy of all its bad deeds. These painful memories deal Magic damage equal to half of the amount of damage that the offending troop dealt in its last attack. Damage also depends on the leadership of the Skald troops, compared with that of the target troop (at least 1 for each Scald in the troop).

singer_header=^def_hint_t0^Singer
singer_hint=^def_hint_t1^Supports the morale of the soldiers with songs and poems. Increases morale of all Viking units by 1. Does not work on Scalds.

valhalla_passer_header=^def_hint_t0^Escort to Valhalla
valhalla_passer_hint=^def_hint_t1^Praises allies who have fallen in battle. Raises the Initiative of allied Viking troops by 1 for 2 turns.

shield_bash_header=^def_hint_t0^Shock Shield
shield_bash_hint=^def_hint_t1^If the opponent counter-attacks, the Berserker immediately makes another attack with his shield, inflicting 3-5 Physical damage, and stunning the target with a probability of 20%.

wild_rage_header=^def_hint_t0^Mad Fury
wild_rage_hint=^def_hint_t1^If the troop loses 50% of its soldiers, the remaining forces enter an uncontrolled fury.

disregard_pain_header=^def_hint_t0^Disregard for Pain
disregard_pain_hint=^def_hint_t1^With every hit missed, the Berserker becomes less sensitive to pain, increasing resistance to all types of damage by 5%. The maximum bonus to all Resistances is +25%.

odines_gift_header=^def_hint_t0^Gift of Odin
odines_gift_hint=^def_hint_t1^Creatures of level 1-3 with the Leadership lower than that of the attacking troop don't respond to the attacks.

god_envoy_header=^def_hint_t0^Messenger of the Gods
god_envoy_hint=^def_hint_t1^Raises the Initiative of allied Vikings by 1.<br>Lowers the Attack and Defense of the enemies standing next to the Warrior Maiden by 10%.

bear_cavalry_header=^def_hint_t0^Bear Cavalry
bear_cavalry_hint=^def_hint_t1^+1 morale of all Bears in the army.

witching_staff_header=^def_hint_t0^Witching Staff
witching_staff_hint=^def_hint_t1^Their enchanted staves can strike an enemy at any distance. Has a 50% chance of stripping one positive effect from the target.

loki_gift_header=^def_hint_t0^Divine Hand
loki_gift_hint=^def_hint_t1^If an ally scores a Critical Hit, the Attack of all Soothsayers increases by 1, up to a maximum of +10 Attack.

knowledge_keeper_header=^def_hint_t0^Keeper of Knowledge
knowledge_keeper_hint=^def_hint_t1^Enables the friendly Vikings to use the Defense Rune twice per round.<br>Allies of other races get +4 Defense.

elemental_shield_header=^def_hint_t0^Elemental Shield
elemental_shield_hint=^def_hint_t1^Resistance to Fire and Cold +10%.<br>Taking any damage from one of these elements increases the corresponding Resistance by 4%, and reduces the opposite resistance by 6%, up to a maximum of +20% bonus and -30% penalty to Resistances.

odines_armor_header=^def_hint_t0^Enchanted Armor
odines_armor_hint=^def_hint_t1^Unit enjoys a 25% resistance to Physical damage, and a 10% resistance to Fire damage. <br>Also, there is a 20% chance that the troop's enchanted armor will absorb half of any damage incurred.

storm_axe_header=^def_hint_t0^Elemental Axe
storm_axe_hint=^def_hint_t1^The troop's battle axe, steeped in the power of the ice-storm, may either freeze or shock enemy troops during a successful strike.

united_we_stand_header=^def_hint_t0^Shoulder to Shoulder
united_we_stand_hint=^def_hint_t1^All allies of levels 1-3 standing near the hero raise their own Attack and Defense by 10%.


// ОРКИ
orc_trophy_header=^def_hint_t0^Adrenaline
orc_trophy_hint=^def_hint_t1^Adrenaline received in battle enhances certain features of the troops and enables them to use talents.<br>If the creature’s amount of Adrenaline is not enough to use the certain talent, the talent loses its charge. As soon as the creature accumulates enough Adrenaline, the talent receives a charge automatically.<br>Actions that affect the amount of Adrenaline:<br>  Entering combat: <gen=hintgen_orc_trophy_start>,<br>  Attacking an enemy: <gen=hintgen_orc_trophy_attack>,<br>  Killing an enemy: <gen=hintgen_orc_trophy_kill>,<br>  Taking damage: <gen=hintgen_orc_trophy_damage>,<br>  Waiting: <gen=hintgen_orc_trophy_skip>.

goblin_zeroingini_header=^def_hint_t0^Zeroing In
goblin_zeroingini_hint=^def_hint_t1^These axe throwers increase damage inflicted on the enemy in this cell by 10%. The maximum damage bonus is 30%.

giant_killer_header=^def_hint_t0^Titan Slayer
giant_killer_hint=^def_hint_t1^The fear of giant creatures gives the troop strength when they fight against them. Inflicted damage is increased by 5% for every point of difference between the levels of the target and the goblin. Every 10 Adrenaline points increase this bonus by 1% (to a maximum equal to +5% of total Adrenaline).

goblin_rageus_header=^def_hint_t0^Irascible
goblin_rageus_hint=^def_hint_t1^When taking damage, the troop increases its speed by 1. This effect stacks, but the maximum Speed increase cannot be greater than 3.

ansestral_anger_header=^def_hint_t0^Ancestral Anger
ansestral_anger_hint=^def_hint_t1^The troop performs a ranged attack against the enemy, summoning an ancestral spirit that deals Cold damage to the target.<br>Every 5 Adrenaline points allow the spirit to ignore 2% of the target’s Resistance (to a maximum ignored Resistance equal to 20% of total Adrenaline).

one_with_spirits_header=^def_hint_t0^Spirit Walker
one_with_spirits_hint=^def_hint_t1^10% resistance to Magic damage. 15% resistance to Astral damage.

one_keeper_header=^def_hint_t0^Keeper
one_keeper_hint=^def_hint_t1^The troop receives 25% of the average value of Adrenaline of all friendly orcs at the beginning of its turn.

pyromancer_header=^def_hint_t0^Pyromancer
pyromancer_hint=^def_hint_t1^Fire damage resistance -50%.<br>Attacks and talents always set off bombs and mines.<br>Every point of Adrenaline increases the chance to set the target on fire by 1% to a maximum of +50%. Affects both attacks and talents.

orc_furious_header=^def_hint_t0^Thirst for Battle
orc_furious_hint=^def_hint_t1^Critical damage is always dealt in counterattacks.<br>Every 5 Adrenaline points increase the chance of Critical Hit when the orc attacks by 2% (to a maximum of +20%).

double_attack_header=^def_hint_t0^Counterattack
double_attack_hint=^def_hint_t1^If the enemy counter-attacks, the troop delivers yet another blow to the enemy. Does not work against enemies with passive attacks, or against Furious enemies.

arbalester_header=^def_hint_t0^Crossbowman
arbalester_hint=^def_hint_t1^Ranged attacks and talents ignore 20% of the target’s Defense. Every 5 Adrenaline points allow you to ignore 3% of Defense (to a maximum ignored Defense equal to 30% of total Adrenaline).

wolf_cavalry_header=^def_hint_t0^Wolf Cavalry
wolf_cavalry_hint=^def_hint_t1^+1 Morale to all wolves and werewolves (in both forms).

trophy_control_header=^def_hint_t0^Adrenaline Control
trophy_control_hint=^def_hint_t1^Receives 1 Adrenaline for each 10 Adrenaline gained by allies.

calm_header=^def_hint_t0^Calm
calm_hint=^def_hint_t1^The troop receives 25% fewer Adrenaline points from its attacks.<br>Morale cannot be negative.

shaman_header=^def_hint_t0^Shaman
shaman_hint=^def_hint_t1^The Adrenaline bar has a 100% chance of being completely refilled at the beginning of the unit’s turn.<br>Each Adrenaline point that the Shaman has at the beginning of his turn reduces this chance by 1%.
//Например, при 80 Адреналина у Шамана шкала заполнится полность с вероятностью (100-80)%=20%.

heavy_hand_header=^def_hint_t0^Heavy Hand
heavy_hand_hint=^def_hint_t1^The troop’s strikes have a 30% chance of reducing its target’s Speed to 2.<br>125% damage is inflicted on soaring creatures and 150% damage on flying creatures.

thick_skin_header=^def_hint_t0^Thick Skin
thick_skin_hint=^def_hint_t1^+10% Resistance of every type.<br>Every 5 Adrenaline points increase the Resistance bonus by 1% (to a maximum equal to 10% of total Adrenaline).

crushing_blow_header=^def_hint_t0^Devastate
crushing_blow_hint=^def_hint_t1^20% damage is dealt to all enemy troops around the target.<br>Each 5 Adrenaline points increase the damage dealt to troops next to the target by 1%.


// ЯЩЕРЫ
worm_header=^def_hint_t0^Worm
worm_hint=^def_hint_t1^Vulnerable to Physical damage (Resistance -10%).<br>Vulnerable to Fire (Resistance -10%).<br>Resistent to Poison (Resistance +10%).

reptile_header=^def_hint_t0^Reptile
reptile_hint=^def_hint_t1^Cold-blooded reptiles have the following properties: resistent to Poison (Resistance +20%).<br>Vulnerable to Cold (Resistance -20%).<br>In snowy areas, their Attack and Defense is reduced by 30%.

eworm_header=^def_hint_t0^Burrow
eworm_hint=^def_hint_t1^The troop can move under the ground, ignoring all obstacles. <br>The troop can attack remotely, from underground, then burrow back to its original location.

spear_header=^def_hint_t0^Spear
spear_hint=^def_hint_t1^The troop can thrust its spear across two cells at once, provided neither cell contains allies.

scale_skin_header=^def_hint_t0^Rugged Scales
scale_skin_10_hint=^def_hint_t1^Resistance to physical damage 10%. <br>The troop receives half damage from non-magical attacks: arrows and projectiles.
scale_skin_15_hint=^def_hint_t1^Resistance to physical damage 15%.<br>The troop receives half damage from non-magical attacks: arrows and projectiles.

blood_lust_header=^def_hint_t0^Bloodlust
blood_lust_hint=^def_hint_t1^After scoring a kill, the troop has a 50% probability of receiving an extra turn.

blood_shot_header=^def_hint_t0^Magic Missile
blood_shot_hint=^def_hint_t1^Attacks remotely with a magic projectile.

fly_krit_header=^def_hint_t0^Sharp Beak
fly_krit_hint=^def_hint_t1^When attacking along a straight line, the troop always inflicts Critical damage.

no_move_header=^def_hint_t0^Stationary
no_move_hint=^def_hint_t1^The troop cannot move.

three_horn_header=^def_hint_t0^Triple-horned
three_horn_hint=^def_hint_t1^The troop can attack three cells at once.

thorn_header=^def_hint_t0^Spiked
thorn_hint=^def_hint_t1^Enemies receive damage from the troop's sharp horns, if they attack when he is dug in and unresponsive.

no_retaliation0_header=^def_hint_t0^Cannot Counter
no_retaliation0_hint=^def_hint_t1^The troop cannot counterattack.

tiran_header=^def_hint_t0^Tyrant
tiran_hint=^def_hint_t1^All enemies in neighboring cells suffer a 30% penalty to their base Defense.

giant_lizard_header=^def_hint_t0^Giant Lizardman
giant_lizard_hint=^def_hint_t1^All Lizardmen in the army receive +1 Morale.

predator_header=^def_hint_t0^Predator
predator_hint=^def_hint_t1^When destroying a troop, predators can eat the corpse to restore their health.


// ДЕМОНЫ
demon_fury_header=^def_hint_t0^Frenzy
demon_fury_hint=^def_hint_t1^Frenzy accumulated in battle strengthens the troop and speeds up the cooldown of its talents.<br>Every 10 Frenzy points increase the troop’s base Attack and Defense by <gen=hintgen_demon_fury_bonus_atk>.<br>Every 10 Frenzy points also give the troop a <gen=hintgen_demon_fury_bonus_rel> chance of reducing its talent cooldown by 1. If the cooldown time is decreased, the troop spends <gen=hintgen_demon_fury_bonus_rel2> Frenzy points for every turn within the decreased cooldown time.<br>Actions that affect the amount of Frenzy include:<br>  Enemy attack: <gen=hintgen_demon_fury_attack>,<br>  Use of a talent which does not deal direct damage: <gen=hintgen_demon_fury_talent>,<br>  Damage received: <gen=hintgen_demon_fury_damage>.

firemental_header=^def_hint_t0^Fire Elemental
firemental_hint=^def_hint_t1^This unit has the following characteristics:<br>Immunity to Mind spells and certain other spells.<br>Its Fire Resistance cannot be lower than 80%. This troop cannot be burned. <br>There is a 50% chance that the enemy will be set ablaze when melee damage is received or inflicted.

demon_header=^def_hint_t0^Demon
demon_hint=^def_hint_t1^Demonic creatures from another world have a number of characteristics: <br>Vulnerability to Cold (-25% Resistance).<br>Fire Protection (+50% Resistance).<br>Vulnerability to divine attacks of the Light (150% damage). <br>Immunity to certain spells.<br>Defense is increased by 50% in lava arenas and reduced by 50% in snowy arenas.

fire_thrower_header=^def_hint_t0^Fire Thrower
fire_thrower_hint=^def_hint_t1^The <label=special_fire_shot_name> talent has 2 independent cooldown times.

return_header=^def_hint_t0^Strike and Return
return_hint=^def_hint_t1^Allows this creature to return to its starting position after attacking.

three_head_header=^def_hint_t0^Three-headed
three_head_hint=^def_hint_t1^Its three heads allow the creature to attack three targets at once.

priestess_blood_header=^def_hint_t0^Blood Priestess
priestess_blood_hint=^def_hint_t1^Base attacks and the <label=special_demoness_long_name> talent have a 15% chance of applying a <label=effect_bleed_name> effect to the target.

domination_header=^def_hint_t0^Domination
domination_hint=^def_hint_t1^Causes an additional 30% Damage to creatures under level 4.

giveap_header=^def_hint_t0^Demonic Fury
giveap_hint=^def_hint_t1^When a Demon receives damage after its turn, it has a 50% chance of taking another turn in this Round, and an additional Action Point for it. <br>This excludes enemy's counter-attacks.

panik_header=^def_hint_t0^Terrifying
panik_hint=^def_hint_t1^When attacking this troop, any creature of Level 1-4 has a 30% chance of panicking.<br>This has no effect on mechanisms and creatures immune to Mind effects.

chaosmissile_header=^def_hint_t0^Chaos Magic
chaosmissile_hint=^def_hint_t1^The enemy is struck with four clots of Chaos that deal Fire, Ice, Magic, and Poison damage. Every clot has a 10% chance of applying a <label=effect_burn_name> (Fire), <label=effect_freeze_name> (Ice), <label=effect_shock_name> (Magic), or <label=effect_poison_name> (Poison) effect. No distance penalty.

firemastery_header=^def_hint_t0^Power over Fire
firemastery_hint=^def_hint_t1^30% Resistance to Fire damage. The troop cannot be burned.<br>If it is attacked, enemies not immune to fire are set ablaze.

teleportation_header=^def_hint_t0^Teleportation
teleportation_hint=^def_hint_t1^The troop can move across the battlefield instantly, ignoring all obstacles.<br>When attacking an enemy with a melee attack, the troop has a 50% chance of dealing an attack which cannot be countered and then returning to its starting position.



// НЕЖИТЬ
necro_energy_header=^def_hint_t0^Necro Energy
necro_energy_hint=^def_hint_t1^The creature is able to absorb the energy of death spilled on the battlefield. The absorbed Necro Energy heals damage inflicted on the undead and even rises the slain back to fight again on the battlefield.

undead_header=^def_hint_t0^Undead
undead_hint=^def_hint_t1^Undead creatures have the following properties:<br>Poison Protection (50% resistance).<br>Vulnerability to divine attacks of the Light (150% damage).<br>Immunity to Mind spells and certain other spells.<br>An Attack bonus of 50% at night and in dungeons.<br>+1 Morale when fighting in cemeteries.

bone_header=^def_hint_t0^Bone
bone_hint=^def_hint_t1^Suffers only 30% Damage from arrows.

uncursed_header=^def_hint_t0^Cursed
uncursed_hint=^def_hint_t1^When attacking, the creature has a 50% chance of successfully cursing the enemy.

rotting_header=^def_hint_t0^Decaying
rotting_hint=^def_hint_t1^Whenever one or more zombies in the troop are killed, the troop has a 10% chance of releasing ptomain, that infects any neighboring troops with terrible plague.<br>Always releases ptomain, if the entire troop is destroyed.

treasure_searcher_header=^def_hint_t0^Cursed Treasure Hunter
treasure_searcher_hint=^def_hint_t1^If there is a treasure chest in the arena, the Pirate Ghost will instantly teleport to it at the beginning of his turn.

soul_drain_header=^def_hint_t0^Soul Draining
soul_drain_hint=^def_hint_t1^The size of the troop grows due to the soul draining of the dead enemies.

vampirism_header=^def_hint_t0^Vampirism
vampirism_hint=^def_hint_t1^The troop leeches a part of the enemy's health points, recovering its own health. Any troops destroyed are resurrected.

dead_evasion_header=^def_hint_t0^Death's Deception
dead_evasion_hint=^def_hint_t1^Avoids Critical Hits by vanishing into the shadows.

increasing_anger_header=^def_hint_t0^Rising Fury
increasing_anger_hint=^def_hint_t1^Every attack, the troop receives a +3 Damage bonus and a +3% chance of scoring a Critical Hit, up to a maximum of +15 damage and +15% critical hit.

dark_cloud_header=^def_hint_t0^Cloud of Darkness
dark_cloud_hint=^def_hint_t1^The troop performs a ranged attack, casting Magic upon an enemy target and any surrounding troops. The damaged troops get cursed.

necromant_header=^def_hint_t0^Necromancer
necromant_hint=^def_hint_t1^After battle Goblins, Skeleton Archers, Zombies or Decaying Zombies with total Leadership equal to 3% of Necromancer troop Leadership join the army.

poison_br_header=^def_hint_t0^Poison Breath
poison_br_hint=^def_hint_t1^Has a 50% probability of poisoning the target.


// Нейтралы
plant_header=^def_hint_t0^Plant
plant_hint=^def_hint_t1^Plants have neither a mind nor animal flesh, and they have the following features: <br>Immunity to Mind spells and certain other spells.<br>Vulnerability to Fire (-100% resistance).<br>Poison Protection (+50% resistance).<br>Every turn restores 10% maximum Health.

mech_header=^def_hint_t0^Mechanism
mech_hint=^def_hint_t1^A mechanical creature that has neither intellect nor animal flesh. It has the following properties:<br>Always neutral Morale.<br>Immunity to Mind spells.<br>Poison Immunity (+80% resistance, and the troop cannot be poisoned).<br>Vulnerability to Magic (-50% resistance).<br>Cannot be healed or resurrected.<br>If friendly mechanisms are present, <label=inf_dwarfs_race_head> and <label=inf_dark_dwarfs_race_head> receive +1 Morale.

ice_creature_header=^def_hint_t0^Ice Creation
ice_creature_hint=^def_hint_t1^A creature of ice, by its nature, has a number of features:<br>Immune to Mind spells and certain other magic.<br>Resistance to Physical damage (Resistance +25%).<br>Protection from Poison (Resistance +50%).<br>Weakness to Fire (Resistance -100%).<br>Immunity to Cold (Resistance 80%, the unit can't be frozen).<br>On snowy arenas its Defense is increased by 50%. On fiery arenas, Defense is reduced by 50%.

robbery_header=^def_hint_t0^Robber
robbery_hint=^def_hint_t1^The morale of humanoid troops (level 1 or 2) in the army is decreased by 1.

berserk_header=^def_hint_t0^Berserker
berserk_hint=^def_hint_t1^The Berserker remains in an unmanageable berserk state, and is immune to Mind effects.

gold_digger_header=^def_hint_t0^Excavator
gold_digger_hint=^def_hint_t1^The troop is capable of finding 10% more gold.

flame_scull_header=^def_hint_t0^Flaming Skull
flame_scull_hint=^def_hint_t1^This troop attacks remotely with a blast of a burning skull, which inflicts Fire damage upon the target. Demon targets suffer 150% Magic damage.

demonologist_header=^def_hint_t0^Demonology
demonologist_hint=^def_hint_t1^The troop receives +1 Morale if there are demons in the army, and +5 Attack in fiery environments.

gate_keeper_header=^def_hint_t0^Gatekeeper
gate_keeper_hint=^def_hint_t1^When anyone opens a portal by using "Teleport" or "Infernal Exchange", the Demonologist receives a bonus of +2 to Attack and Defense.

dark_soul_header=^def_hint_t0^Servant of Death
dark_soul_hint=^def_hint_t1^Assassins are faithful servants of the god of Death. They are subject to hypnosis, immune to all other positive spells and effects, including other Mind attacks. When under the influence of hypnosis, the assassin loses his privileges as a servant of Death.

hypocrite_header=^def_hint_t0^Histrionic
hypocrite_hint=^def_hint_t1^After playing hundreds of parts and wearing hundreds of masks, the creature is immune to the Pain Mirror spell (and similar effects).<br>The duration of spells and effects affecting the mind is reduced by 2.

bomber_header=^def_hint_t0^Bomber
bomber_hint=^def_hint_t1^Base attack is replaced by a bunch of bombs that is hung on the enemy, blowing up after 3 turns. Each Girl adds one bomb to the bunch which deals 1-3 Physical damage to the target and nearby troops when it blows up.

no_damage_header=^def_hint_t0^Invulnerable
no_damage_hint=^def_hint_t1^Nobody is capable of harming a child. Enemies, including enemy heroes, ignore these creatures. Accidental damage caused by spells and talents cast in the area is completely absorbed.

freedom_liker_header=^def_hint_t0^Claustrophobic
freedom_liker_hint=^def_hint_t1^This unit feels uncomfortable in the close spaces. When underground, its Attack is reduced by 50%.

dragon_cavalry_header=^def_hint_t0^Dragon Guardian
dragon_cavalry_hint=^def_hint_t1^Dragons Prefer Princesses.<br>All allied dragons receive +1 Morale. Does not affect summoned dragons.
// сделано как талант: <br>At the start of battle summons a dragon ally. The total leadership of Dragon Riders and summoned dragons does not exeed hero Leadership.

shock_header=^def_hint_t0^Shock
shock_hint=^def_hint_t1^The troop's attack has a 30% probability of shocking the enemy, which reduces the target's Initiative and Action Points to 1.

stone_skin_header=^def_hint_t0^Stone Skin
stone_skin_hint=^def_hint_t1^Its natural armor grants the troop 20% resistance to Physical damage.

ice_spit_header=^def_hint_t0^Spits Ice
ice_spit_hint=^def_hint_t1^This troop spits blobs of ice at enemies, with a 30% chance of freezing the target for 2 turns. The troop receives some shooter bonuses.

carrion_header=^def_hint_t0^Scavenger
carrion_hint=^def_hint_t1^Scavengers can reach a fallen troop which would otherwise be beyond reach, receiving two additional Action Points.

band_header=^def_hint_t0^Horde
band_hint=^def_hint_t1^Increases Attack and Defense, depending on the troop’s strength, as compared to its original stats. The maximum bonus is +50% Attack and Defense.

spiteful_header=^def_hint_t0^Brutal
spiteful_hint=^def_hint_t1^When a bear receives damage, its Attack is doubled for the remainder of the round.<br>This does not include damage incurred by counter-attacks.

drowsiness_header=^def_hint_t0^Hibernation
drowsiness_hint=^def_hint_t1^The creature can fall asleep from inactivity. It then awakens when attacked. While sleeping, the creature recovers health.

dragon_hate_header=^def_hint_t0^Dragon Despiser
dragon_hate_hint=^def_hint_t1^Inflicts double damage to Dragons. Suffers lower morale if the army contains a dragon.

ideal_header=^def_hint_t0^Regal
ideal_hint=^def_hint_t1^Grants confidence to Griffins and Humans of level 1-3, giving +1 Morale.

antimage_header=^def_hint_t0^Negates Magic
antimage_hint=^def_hint_t1^The troop is immune to the effects of spells, and enjoys +25% Resistance to Magic attacks.

fear_header=^def_hint_t0^Frightening
fear_hint=^def_hint_t1^The troop's attack may frighten the opponent. A frightened opponent is unable to counter-attack.

devilkrit_header=^def_hint_t0^Frightful Fish
devilkrit_hint=^def_hint_t1^The vicious bite transfers to the target the Devilfish's malice and hatred. For the next four turns, the victim's chance of performing a critical strike increases by 40%.

weakness_header=^def_hint_t0^Weakness
weakness_hint=^def_hint_t1^When attacking, the creature has 30% chance of casting "Weakness" on the enemy troop.

palsy_header=^def_hint_t0^Paralyzes
palsy_hint=^def_hint_t1^The unit's attack can strip the targeted troop of its remaining Action Points, with a probability of 10*(6 - enemy's level).

paralyse_header=^def_hint_t0^Paralyzing Ray
paralyse_hint=^def_hint_t1^Performs a ranged attack which has a chance of lulling the enemy to sleep for one turn. The lower the level of the enemy, the higher the chance of rendering him unconscious.

freezing_touch_header=^def_hint_t0^Freezing Touch
freezing_touch_hint=^def_hint_t1^The unit's attack freezes its target.

ice_shards_header=^def_hint_t0^Ice Shards
ice_shards_hint=^def_hint_t1^The troop shoots ice shards from its skin, affecting any units within a radius of 2 cells. These shards Inflict 40-60 cold damage, with a 25% chance to cause bleeding for 3 turns. <br>This feature is triggered upon the death of one or more units in the troop.

creator_header=^def_hint_t0^Creator
creator_hint=^def_hint_t1^The troop knows how to create life from the death energy. The destruction of an enemy unit yields a charge for the talent <label=special_summon_ice_minion_name>.<br>Upon its own death, the Ice Dragon is converted into pure Mana, becoming a bundle of magical energy.

magic_drin_header=^def_hint_t0^Enchanted Mace
magic_drin_hint=^def_hint_t1^Thanks to the magic spells enclosed in it, Jotun's cudgel can either freeze enemies with probability of 30%, or heal its owner for a total of 10% of the health taken from enemies in the battle.


troll_header=^def_hint_t0^Troll Skin
troll_hint=^def_hint_t1^In the light of day, the skin of the troll turns to stone, restraining its movement, but granting it additional protection.<br>In the evening and at night, and in caves, trolls enjoy:<br>  Regeneration (each turn restores their health to maximum).<br>  Free movement (+1 Speed and Initiative).<br>  Resistance to Physical, Fire and Icy damage +15%.<br>In the morning and afternoon:<br>  Resistance to Physical, Fire and Icy damage +30%.

stone_statue_header=^def_hint_t0^Petrify
stone_statue_hint=^def_hint_t1^After death, the Troll turns into a stone statue, which serves as an obstacle.

gloating_header=^def_hint_t0^Malevolent
gloating_hint=^def_hint_t1^Whenever a unit is defeated (excluding defeats by spell attacks), Troll units are overjoyed and receive +5 Attack.

stone_header=^def_hint_t0^Stone
stone_hint=^def_hint_t1^Magically animated stone creature boasts impressive resistances:<br>Immune to Mind attacks and some spells.<br>+30% Resistance to Physical damage.<br>+70% Resistance to Poison.<br>+30% Resistance to Fire.

hates_giants_header=^def_hint_t0^Hates Giants
hates_giants_hint=^def_hint_t1^Inflicts double damage against giants. The troop's morale suffers if there is a giant in the army.

dragon_power_header=^def_hint_t0^Dragon Power
dragon_power_hint=^def_hint_t1^The presence of such a powerful enemy as the Black Dragon inspires fear in the hearts of enemies below level 5, and reduces their Initiative.

orb_header=^def_hint_t0^Ball
orb_hint=^def_hint_t1^The ball moves only in a straight line and stops when it encounters an obstacle. It builds up speed as it rolls, increasing Damage by 100% for each cell traversed.

spell1_header=^def_hint_t0^Common Spells
spell1_hint=^def_hint_t1^Casts basic attacking and weakening spells. <br>Power level: I. <br>
spell2_header=^def_hint_t0^Strong Spells
spell2_hint=^def_hint_t1^Casts strong attacking and weakening spells and curses.<br>Power level: II. <br>
spell3_header=^def_hint_t0^Powerful Spells
spell3_hint=^def_hint_t1^Casts powerful attacking and weakening spells. Can also cast Mind and Distortion spells.<br>Power level: III. <br>

ram_header=^def_hint_t0^Sheep
ram_hint=^def_hint_t1^After being turned into Sheep, creatures are unable to do anything other than bleat helplessly and aimlessly wander around.

fire_breath_header=^def_hint_t0^Firestorm
fire_breath_hint=^def_hint_t1^This unit can strike three enemy troops at once, and set its targets ablaze.

rebirth_header=^def_hint_t0^Rebirth
rebirth_hint=^def_hint_t1^If destroyed, the creature can rise from the ashes.

lava_creature_header=^def_hint_t0^Lava
lava_creature_hint=^def_hint_t1^This magical creature's flesh is woven of red-hot magma. Its features include:<br>Immunity to Mind spells and certain other magic.<br>+25% Resistance to Physical attacks.<br>+50% Resistance to Poison.<br>Vulnerability to Cold (Resistance +50%).<br>Immunity to Fire (Resistance 80%, and the unit cannot be set ablaze).<br>On the snowy arenas, Defense increases by 50%, but in fiery arenas, Defense is reduced by 50%.

bash_strike_header=^def_hint_t0^Stuns
bash_strike_hint=^def_hint_t1^Stuns enemies below level 5.
